Repository: siangry/numberland_adventure
Catalog: lib/l10n/intl_*.arb
Languages: ms, zh

# welcomeToNumberland
source: Welcome to Numberland, a magical world where numbers live and play!
ms: Selamat datang ke Numberland, sebuah dunia ajaib angka hidup dan bermain!
zh: 欢迎来到数字乐园，一个数字生活和游戏的神奇世界！

# butOhNo
source: But oh no! The Number King needs your help!
ms: Oh! Raja Angka memerlukan bantuan anda!
zh: 哦，不！数字国王需要你的帮助！

# theMischievousGlobin
source: The mischievous Mix-Up Goblin has scrambled all the numbers, and now everything is out of order.
ms: Goblin Pengacau yang nakal telah mengacak-acak semua angka, dan sekarang semuanya menjadi tidak beraturan.
zh: 调皮的混淆妖精把所有数字都弄乱了，现在一切都乱套了。

# canYouHelpToRestore
source: Can you help to restore the balance of Numberland?
ms: Bolehkah anda membantu untuk memulihkan keharmonian Numberland?
zh: 您能帮助恢复数字王国的平衡吗？

source: The Magic Bridge
ms: Jambatan Ajaib
zh: 魔法桥梁

source: The Tower of Numbers
ms: Menara Nombor
zh: 数字之塔

source: The Magical Potion
ms: Ramuan Ajaib
zh: 神奇药水

source: Easy
ms: Mudah
zh: 简单

source: Medium
ms: Sederhana
zh: 中等

source: Hard
ms: Susah
zh: 困难

# congratulationYouSave
source: Congratulation! You save the Numberland!
ms: Tahniah! Anda berjaya menyelamatkan Numberland!
zh: 祝贺你！你成功拯救了数字王国！

# theNumberKingCastle
source: The Number King's castle is across a river, but the bridges are enchanted!
ms: Istana Raja Angka berada di seberang sungai, tetapi jambatannya dipesona oleh Goblin Pengacau!
zh: 数字国王的城堡在河对岸，但桥被施了魔法！

# toCrossYouMustChoose
source: To cross, you must choose the right bridge by comparing two number signs
ms: Untuk menghilangkan sihir, anda harus memilih jambatan yang betul dengan membandingkan dua nombor
zh: 要想过桥，你必须通过比较两个数字来选择正确的桥梁

# pickTheBiggerorSmaller
source: Pick the bigger number or smaller number, as the king requests, to make the bridge appear!
ms: Pilih nombor yang lebih besar atau nombor yang lebih kecil, menurut permintaan Raja Angka, untuk membuat jambatan muncul!
zh: 按照国王的要求，选择较大的数字或较小的数字，让桥出现！

source: Which number is bigger?
ms: Nombor manakah yang lebih besar?
zh: 哪一个数字更大？

source: Which number is smaller?
ms: Nombor manakah yang lebih kecil?
zh: 哪一个数字更小？

source: Bingo! You are correct!
ms: Bingo! Anda betul!
zh: 噔噔！你答对了！

source: Oops! You are wrong!
ms: Aduh! Anda salah!
zh: 哎呀！你答错了！

# congratulationYouHaveLifted
source: Congratulation! You have lifted the spell.
ms: Tahniah! Anda telah berjaya menghilangkan sihir.
zh: 恭喜你！你成功解除了咒语。

# oopsYouHaventLifted
source: Oops! you fail to lift the spell.
ms: Aduh! Anda telah gagal menghilangkan sihir.
zh: 哎呀！你没能解除咒语。

# theMixUpGlobin
source: The Mix-Up Goblin has jumbled the Number Towers in Numberland!
ms: Goblin Pengacau telah mengacaukan Menara Nombor di Numberland!
zh: 混淆妖精把数字王国的数字塔弄乱了！

# theOnlyWayToFix
source: The only way to fix them is by arranging the number blocks in ascending or descending order.
ms: Satu-satunya cara untuk membetulkannya adalah menyusun blok nombor dalam tertib menaik atau menurun.
zh: 解决这个问题的唯一办法是按顺序或逆序排列数字方块。

# arrangetheNumberBlocks
source: Arrange the number blocks to build the correct tower and restore Numberland's skyline!
ms: Susun blok nombor untuk membina menara yang betul dan memulihkan latar langit Numberland!
zh: 排列数字积木，建造正确的塔楼，恢复数字王国的天际线！

# arrangeNumbersInAscending
source: Arrange numbers in ascending order (small to big)
ms: Susun nombor dalam tertib menaik (kecil ke besar)
zh: 按顺序（从小到大）排列数字

# arrangeNumbersInDescending
source: Arrange numbers in descending order (big to small)
ms: Susun nombor dalam tertib menurun (besar ke kecil)
zh: 按逆序（从大到小）排列数字

# fromLeftToRight
source: **From left to right & top to bottom
ms: **Dari kiri ke kanan & atas ke bawah

# congratulationYouHavehelp
source: Congratulation! You have successfully built the correct tower.
ms: Tahniah! Anda telah berjaya membina Menara Nombor dengan betul.
zh: 恭喜你！你成功建造了正确的数字塔。

# oopsTheTowerIsNotBuilt
source: Oops! The tower is not built correctly.
ms: Aduh! Menara Nombor tidak dibina dengan betul.
zh: 哎呀！你没能建造正确的数字塔。

# theNumberWizardNeeds
source: The Number Wizard needs your help to make magic potions!
ms: Wizard Nombor memerlukan bantuan anda untuk membuat ramuan ajaib!
zh: 数字魔法师需要你帮忙制作魔法药水！

# toCompleteTheSpell
source: To complete the spell, you must combine two numbers to match the correct potion recipe.
ms: Untuk melengkapkan sihir, anda harus menggabungkan dua nombor menurut resipi ramuan yang betul
zh: 要完成咒语，你必须将两个数字组合起来，以匹配正确的药水配方。

# mixTheRightNumbers
source: Mix the right numbers in the wizard's cauldron to create a glowing potion!
ms: Campurkan nombor yang betul dalam kawah ahli sihir untuk mencipta ramuan bercahaya!
zh: 在巫师的大锅中混合正确的数字，制作出光明药水！

# weNeedToMake
source: We need to make {composeValue}! What is the number product of mixing two number ingredients?
ms: Anda perlu membuat {composeValue}! Apakah hasil nombor yang didapat daripada campuran dua bahan nombor?
zh: 你需要制作 {composeValue}！混合两种数字成分所获得的数字成品是多少？

# congratulationYouHaveCreated
source: Congratulation! You have created a glowing potion.
ms: Tahniah! Anda telah berjaya mencipta ramuan bercahaya.
zh: 恭喜你！你成功创造了光明药水。

# oopsYouHaveCreated
source: Oops! You have created a deadly potion instead.
ms: Aduh! Sebaliknya kamu telah mencipta ramuan yang mematikan.
zh: 哎呀！你没能创造光明药水。

# theCorrectNumberIs
source: The correct answer is {answer}
ms: Jawapan yang betul ialah {answer}
zh: 正确答案是{answer}

source: Language
ms: Bahasa

source: English
ms: Inggeris

source: Chinese
ms: Cina

source: Malay
ms: Melayu

source: Settings
ms: Pengaturan

source: Music
ms: Lagu
